Repository: Tencent-RTC/TUIKit_iOS
Catalog: room/Resources/Localized/TUIRoomKitLocalized.xcstrings
Source language: en
Languages: ar, ja, zh_hans

# roomkit_input_can_not_empty
source: input can't be empty!
ar: لا يمكن أن يكون الإدخال فارغاً!
ja: 入力は空にできません!
zh_hans: 输入不能为空

# roomkit_create_room
source: Create room
ar: إنشاء غرفة
ja: ルームを作成
zh_hans: 新建房间

# roomkit_enter_room_id
source: Enter roomID
ar: أدخل معرف الغرفة
ja: ルームIDを入力してください
zh_hans: 请输入房间号

# roomkit_room_type_freedom_speaker
source: Freedom speaker room
ar: غرفة التحدث الحر
ja: 自由発言ルーム
zh_hans: 自由发言房间

# roomkit_join_room
source: Join room
ar: انضم للغرفة
ja: ルームに参加
zh_hans: 加入房间

# roomkit_room_type_stage_speaker
source: On-stage speaking room
ar: غرفة التحدث على المنصة
ja: ステージ発言ルーム
zh_hans: 上台发言房间

# roomkit_room_id
source: Room ID
ar: معرف الغرفة
ja: ルームID
zh_hans: 房间号

# roomkit_room_type
source: Room type
ar: نوع الغرفة
ja: ルームタイプ
zh_hans: 房间类型

# roomkit_start_video
source: Start video
ar: بدء الفيديو
ja: ビデオを開始
zh_hans: 打开视频

# roomkit_stop_video
source: Stop video
ar: إيقاف الفيديو
ja: ビデオを停止
zh_hans: 关闭视频

# roomkit_your_name
source: Your name
ar: اسمك
ja: お名前
zh_hans: 您的姓名

# roomkit_enable_speaker
source: Enable speaker
ar: تفعيل مكبر الصوت
ja: スピーカーを有効にする
zh_hans: 开启扬声器

# roomkit_enable_audio
source: Enable audio
ar: تفعيل الصوت
ja: オーディオを有効にする
zh_hans: 开启音频

# roomkit_enable_video
source: Enable video
ar: تفعيل الفيديو
ja: ビデオを有効にする
zh_hans: 开启视频

# roomkit_mute
source: Mute
ar: كتم الصوت
ja: ミュート
zh_hans: 静音

# roomkit_unmute
source: Unmute
ar: إلغاء كتم الصوت
ja: ミュート解除
zh_hans: 取消静音

# roomkit_end
source: End
ar: إنهاء
ja: 終了
zh_hans: 结束

# roomkit_member_count
source: Members(xxx)
ar: الأعضاء (xxx)
ja: メンバー(xxx)
zh_hans: 成员(xxx)

# roomkit_member
source: Members
ar: الأعضاء
ja: メンバー
zh_hans: 成员

# roomkit_expand
source: Expansion
ar: توسيع
ja: 展開
zh_hans: 展开

# roomkit_user_room
source: xxx's room
ar: غرفة xxx
ja: xxxのルーム
zh_hans: xxx的房间

# roomkit_user_webinar_room
source: xxx's webinar room
ar: غرفة ندوة xxx
ja: xxxのセミナールーム
zh_hans: xxx的研讨会房间

# roomkit_screen_share
source: Screen share
ar: مشاركة الشاشة
ja: 画面共有
zh_hans: 屏幕分享

# roomkit_mute_all_audio
source: Mute all
ar: كتم صوت الجميع
ja: 全員ミュート
zh_hans: 全体静音

# roomkit_unmute_all_audio
source: Unmute all
ar: إلغاء كتم صوت الجميع
ja: 全員ミュート解除
zh_hans: 解除全体静音

# roomkit_more
source: More
ar: المزيد
ja: もっと見る
zh_hans: 更多

# roomkit_search_members
source: Search members
ar: البحث عن أعضاء
ja: メンバーを検索
zh_hans: 搜索成员

# roomkit_invite
source: Invite
ar: دعوة
ja: 招待
zh_hans: 邀请

# roomkit_role_owner
source: Owner
ar: المالك
ja: オーナー
zh_hans: 房主

# roomkit_role_admin
source: Administrator
ar: المسؤول
ja: 管理者
zh_hans: 管理员

# roomkit_me
source: Me
ar: أنا
ja: 自分
zh_hans: 我

# roomkit_room_link
source: Room link
ar: رابط الغرفة
ja: ルームリンク
zh_hans: 房间链接

# roomkit_copy
source: Copy
ar: نسخ
ja: コピー
zh_hans: 复制

# roomkit_copy_room_info
source: Copy room info
ar: نسخ معلومات الغرفة
ja: ルーム情報をコピー
zh_hans: 复制房间信息

# roomkit_msg_all_members_will_be_muted
source: All current and incoming members will be muted
ar: سيتم كتم صوت جميع الأعضاء الحاليين والقادمين
ja: すべての現在および新規メンバーがミュートされます
zh_hans: 所有及新加入的成员将被静音

# roomkit_msg_all_members_video_disabled
source: All current and incoming members will be restricted from video
ar: سيتم تقييد الفيديو لجميع الأعضاء الحاليين والقادمين
ja: すべての現在および新規メンバーのビデオが制限されます
zh_hans: 所有及新加入的成员将被禁止视频

# roomkit_msg_members_cannot_unmute
source: Members will unable to turn on the microphone
ar: لن يتمكن الأعضاء من تشغيل الميكروفون
ja: メンバーはマイクをオンにできなくなります
zh_hans: 成员将无法开启麦克风

# roomkit_msg_members_cannot_start_video
source: Members will unable to turn on video
ar: لن يتمكن الأعضاء من تشغيل الفيديو
ja: メンバーはビデオをオンにできなくなります
zh_hans: 成员将无法开启视频画面

# roomkit_confirm
source: Confirm
ar: تأكيد
ja: 確認
zh_hans: 确认

# roomkit_cancel
source: Cancel
ar: إلغاء
ja: キャンセル
zh_hans: 取消

# roomkit_disable_all_video
source: Stop all video
ar: إيقاف جميع الفيديو
ja: 全員ビデオ禁止
zh_hans: 全体禁画

# roomkit_enable_all_video
source: Enable all video
ar: تفعيل جميع الفيديو
ja: 全員ビデオ許可
zh_hans: 解除全体禁画

# roomkit_msg_all_members_will_be_unmuted
source: All members will be unmuted
ar: سيتم إلغاء كتم صوت جميع الأعضاء
ja: すべてのメンバーのミュートが解除されます
zh_hans: 所有成员将被解除静音

# roomkit_msg_members_can_unmute
source: Members will be able to turn on the microphone
ar: سيتمكن الأعضاء من تشغيل الميكروفون
ja: メンバーはマイクを自由にオンにできます
zh_hans: 解除后用户可以自由开启麦克风

# roomkit_confirm_release
source: Confirm release
ar: تأكيد الإلغاء
ja: 解除を確認
zh_hans: 确认解除

# roomkit_msg_all_members_video_enabled
source: All members will not be restricted from video
ar: لن يتم تقييد الفيديو لجميع الأعضاء
ja: すべてのメンバーのビデオ制限が解除されます
zh_hans: 所有成员将被解除禁止开启视频

# roomkit_msg_members_can_start_video
source: Members will be able to turn on video
ar: سيتمكن الأعضاء من تشغيل الفيديو
ja: メンバーはビデオを自由にオンにできます
zh_hans: 解除后用户可以自由开启视频

# roomkit_toast_all_video_disabled
source: Participants\' video off. Camera access disabled.
ar: تم إيقاف فيديو المشاركين. تم تعطيل الوصول إلى الكاميرا.
ja: 全員のビデオをオフにしました。カメラへのアクセスが無効になりました。
zh_hans: 已关闭所有成员视频，摄像头已禁用

# roomkit_toast_all_video_enabled
source: Participants can now start video.
ar: يمكن للمشاركين الآن بدء الفيديو.
ja: 参加者はビデオを開始できるようになりました。
zh_hans: 已允许成员开启视频

# roomkit_toast_all_audio_disabled
source: Participants muted. Mic access disabled.
ar: تم كتم صوت المشاركين. تم تعطيل الوصول إلى الميكروفون.
ja: 参加者をミュートしました。マイクへのアクセスが無効になりました。
zh_hans: 已静音所有成员，麦克风已禁用

# roomkit_toast_all_audio_enabled
source: Participants can now unmute themselves.
ar: يمكن للمشاركين الآن إلغاء كتم الصوت بأنفسهم.
ja: 参加者は自分でミュートを解除できるようになりました。
zh_hans: 已允许成员开启麦克风

# roomkit_modify_name
source: Modify the name
ar: تعديل الاسم
ja: 名前を変更
zh_hans: 修改名称

# roomkit_request_unmute_audio
source: Ask to unmute
ar: طلب إلغاء كتم الصوت
ja: ミュート解除をリクエスト
zh_hans: 请求开启音频

# roomkit_request_start_video
source: Ask to start video
ar: طلب بدء الفيديو
ja: ビデオ開始をリクエスト
zh_hans: 请求开启视频

# roomkit_transfer_owner
source: Make host
ar: نقل المضيف
ja: ホストを譲渡
zh_hans: 转交房主

# roomkit_set_admin
source: Set as administrator
ar: تعيين كمسؤول
ja: 管理者に設定
zh_hans: 设为管理员

# roomkit_revoke_admin
source: Undo administrator
ar: إلغاء المسؤول
ja: 管理者を解除
zh_hans: 撤销管理员

# roomkit_mute_text_chat
source: Mute message
ar: كتم الرسائل
ja: メッセージ禁止
zh_hans: 禁言

# roomkit_unmute_text_chat
source: Unmute message
ar: إلغاء كتم الرسائل
ja: メッセージ許可
zh_hans: 解除禁言

# roomkit_remove_member
source: Remove
ar: إزالة
ja: 削除
zh_hans: 踢出房间

# roomkit_msg_transfer_owner_to
source: Transfer the host to xxx
ar: نقل المضيف إلى xxx
ja: ホストをxxxに譲渡
zh_hans: 将房主转交给xxx

# roomkit_msg_transfer_owner_tip
source: After transfer the host you will become a general user
ar: بعد نقل المضيف ستصبح مستخدماً عادياً
ja: ホストを譲渡すると一般ユーザーになります
zh_hans: 转交房主后将成为普通成员

# roomkit_confirm_transfer
source: Confirm transfer
ar: تأكيد النقل
ja: 譲渡を確認
zh_hans: 确认转交

# roomkit_toast_you_are_owner
source: You are now a host
ar: أنت الآن مضيف
ja: あなたはホストになりました
zh_hans: 您已成为房主

# roomkit_toast_owner_transferred
source: The host has been transferred to xxx
ar: تم نقل المضيف إلى xxx
ja: ホストがxxxに譲渡されました
zh_hans: 已将房主转交给xxx

# roomkit_toast_you_are_admin
source: You have become a conference admin
ar: لقد أصبحت مسؤول المؤتمر
ja: あなたは管理者になりました
zh_hans: 您已成为管理员

# roomkit_toast_admin_set
source: xxx has been set as conference admin
ar: تم تعيين xxx كمسؤول المؤتمر
ja: xxxを管理者に設定しました
zh_hans: 已将xxx设为管理员

# roomkit_toast_admin_revoked
source: The conference admin status of xxx has been withdrawn
ar: تم سحب صلاحية مسؤول المؤتمر من xxx
ja: xxxの管理者権限を取り消しました
zh_hans: 已将xxx的管理员身份撤回

# roomkit_toast_you_are_no_longer_admin
source: Your conference admin status has been revoked
ar: تم إلغاء صلاحية مسؤول المؤتمر الخاصة بك
ja: あなたの管理者権限が取り消されました
zh_hans: 您的管理员身份被收回

# roomkit_toast_room_id_copied
source: Room ID copied
ar: تم نسخ معرف الغرفة
ja: ルームIDをコピーしました
zh_hans: 房间号已复制

# roomkit_toast_room_link_copied
source: Room link copied
ar: تم نسخ رابط الغرفة
ja: ルームリンクをコピーしました
zh_hans: 房间链接已复制

# roomkit_toast_room_info_copied
source: Room information copied successfully
ar: تم نسخ معلومات الغرفة بنجاح
ja: ルーム情報をコピーしました
zh_hans: 房间信息复制成功

# roomkit_leave_room
source: Leave room
ar: مغادرة الغرفة
ja: ルームを退出
zh_hans: 离开房间

# roomkit_end_room
source: End room
ar: إنهاء الغرفة
ja: ルームを終了
zh_hans: 结束房间

# roomkit_toast_room_ended
source: Room ended
ar: انتهت الغرفة
ja: ルームが終了しました
zh_hans: 房间已结束

# roomkit_confirm_leave_room_by_genera_user
source: Are you sure you want to leave the room
ar: هل أنت متأكد أنك تريد مغادرة الغرفة
ja: ルームを退出してもよろしいですか
zh_hans: 您确定要离开房间吗

# roomkit_confirm_leave_room_by_owner
source: If you don't want to end the conference, please assign a new host before leaving the conference
ar: إذا كنت لا تريد إنهاء المؤتمر، يرجى تعيين مضيف جديد قبل المغادرة
ja: 会議を終了したくない場合は、退出前に新しいホストを指定してください
zh_hans: 如果您不想结束房间，请在离开房间前指定新的主持人

# roomkit_confirm_remove_member
source: Do you want to remove xxx from the room?
ar: هل تريد إخراج xxx من الغرفة؟
ja: xxxをルームから退出させますか？
zh_hans: 是否将xxx移出房间？

# roomkit_ok
source: OK
ar: موافق
zh_hans: 确定

# roomkit_toast_room_closed
source: The room was closed.
ar: تم إغلاق الغرفة.
ja: ルームが閉じられました。
zh_hans: 房间已被销毁

# roomkit_toast_you_were_removed
source: You were removed from the room by the host.
ar: تم إخراجك من الغرفة بواسطة المضيف.
ja: ホストによってルームから退出させられました。
zh_hans: 您已被主持人移出房间

# roomkit_toast_audio_invite_sent
source: The audience has been invited to open the audio
ar: تمت دعوة الجمهور لتشغيل الصوت
ja: 視聴者にオーディオ開始の招待を送信しました
zh_hans: 已向观众发出开启音频邀请

# roomkit_toast_video_invite_sent
source: The audience has been invited to open the video
ar: تمت دعوة الجمهور لتشغيل الفيديو
ja: 視聴者にビデオ開始の招待を送信しました
zh_hans: 已向观众发出开启视频邀请

# roomkit_toast_text_chat_disabled
source: You have been banned from text chat
ar: تم حظرك من الدردشة النصية
ja: テキストチャットが禁止されました
zh_hans: 您已被禁止文字聊天

# roomkit_toast_text_chat_enabled
source: You are allowed to text chat
ar: يُسمح لك بالدردشة النصية
ja: テキストチャットが許可されました
zh_hans: 您已被允许文字聊天

# roomkit_msg_invite_unmute_audio
source: xxx invites you to turn on the microphone
ar: xxx يدعوك لتشغيل الميكروفون
ja: xxxがマイクをオンにするよう招待しています
zh_hans: xxx邀请您开启语音

# roomkit_msg_invite_start_video
source: xxx invites you to turn on the camera
ar: xxx يدعوك لتشغيل الكاميرا
ja: xxxがカメラをオンにするよう招待しています
zh_hans: xxx邀请您开启视频画面

# roomkit_agree
source: Agree
ar: موافق
ja: 同意
zh_hans: 同意

# roomkit_reject
source: Reject
ar: رفض
ja: 拒否
zh_hans: 拒绝

# roomkit_toast_camera_closed_by_host
source: Your camera has been disabled by xxx
ar: xxx قام بتعطيل الكاميرا الخاصة بك
ja: xxxによってカメラが無効化されました
zh_hans: xxx已关闭您的摄像头

# roomkit_toast_muted_by_host
source: Your microphone has been disabled by xxx
ar: xxx قام بتعطيل الميكروفون الخاص بك
ja: xxxによってマイクが無効化されました
zh_hans: xxx已关闭您的麦克风

# roomkit_enter_nickname
source: Enter nickname
ar: أدخل الاسم المستعار
ja: ニックネームを入力してください
zh_hans: 请输入昵称

# roomkit_tip_all_muted_cannot_unmute
source: Muted by host. Unmute disabled.
ar: جميع المشاركين في وضع كتم الصوت ولا يمكن إلغاء الكتم
ja: 全員ミュート中のため、ミュート解除できません
zh_hans: 全员静音中，无法解除静音

# roomkit_tip_all_video_off_cannot_start
source: All on mute video unable to turn on camera
ar: الجميع في وضع كتم الفيديو، لا يمكن تشغيل الكاميرا
ja: 全員ビデオ禁止中のため、カメラをオンにできません
zh_hans: 全员禁画中，无法开启摄像头

# roomkit_room_name
source: Room name
ar: اسم الغرفة
ja: ルーム名
zh_hans: 房间名称

# roomkit_participant
source: Participant(xxx)
ar: مشارك(xxx)
ja: 参加者(xxx)
zh_hans: 嘉宾(xxx)

# roomkit_audience
source: Audience(xxx)
ar: جمهور(xxx)
ja: 観衆(xxx)
zh_hans: 观众(xxx)

# roomkit_entered_room
source: Entered room
ar: تم دخول الغرفة
ja: 入室しました
zh_hans: 进入房间

# roomkit_switch_to_participant
source: xxx has been set as a participant
ar: تم تعيين xxx كضيف
ja: xxxはゲストに設定されました
zh_hans: xxx已被设为嘉宾

# roomkit_switch_to_audience
source: xxx has been set as an audience
ar: تم تعيين xxx كمشاهد
ja: xxxは視聴者に設定されました
zh_hans: xxx已被设为观众

# roomkit_switch_to_participant_byself
source: You have been set as a participant
ar: تم تعيينك كضيف
ja: あなたはゲストに設定されました
zh_hans: 您已被设为嘉宾

# roomkit_switch_to_audience_byself
source: You have been set as an audience
ar: تم تعيينك كمشاهد
ja: あなたは視聴者に設定されました
zh_hans: 您已被设为观众

# roomkit_set_participant
source: Set as participant
ar: تعيين كضيف
ja: ゲストに設定
zh_hans: 设为嘉宾

# roomkit_set_audience
source: Set as audience
ar: تعيين كمشاهد
ja: 視聴者に設定
zh_hans: 设为观众

# roomkit_transcription_open_subtitle
source: Turn On AI Subtitles
ar: تشغيل الترجمة الفورية بالذكاء الاصطناعي
ja: AIリアルタイム字幕をオン
zh_hans: 开启 AI 实时字幕

# roomkit_transcription_open_minutes
source: View AI Meeting Minutes
ar: عرض محضر الاجتماع بالذكاء الاصطناعي
ja: AIリアルタイム議事録を表示
zh_hans: 查看 AI 实时会议记录

# roomkit_transcription_close_subtitle
source: Turn Off AI Subtitles
ar: إيقاف الترجمة الفورية بالذكاء الاصطناعي
ja: AIリアルタイム字幕をオフ
zh_hans: 关闭 AI 实时字幕

# roomkit_transcription_close_minutes
source: Turn Off AI Meeting Minutes
ar: إيقاف محضر الاجتماع بالذكاء الاصطناعي
ja: AIリアルタイム議事録をオフ
zh_hans: 关闭 AI 实时会议记录

# roomkit_transcription_ai_minutes_title
source: AI Meeting Minutes
ar: نسخ الاجتماعات في الوقت الفعلي باستخدام الذكاء الاصطناعي
ja: AIリアルタイム会議文字起こし
zh_hans: AI 实时会议记录

# roomkit_transcription_enable_first
source: Please enable AI transcription first
ar: يرجى تمكين النسخ بالذكاء الاصطناعي أولاً.
ja: まずAI字幕を有効にしてください
zh_hans: 请先开启AI字幕

# roomkit_transfer_host_with_asr_warning
source: After transferring room ownership, you will become a general member. Real-time Subtitles and AI Meeting Minutes will stop and must be re-enabled by the new host.
ar: بعد نقل ملكية الغرفة، ستصبح عضواً عادياً. سيتم إيقاف الترجمة الفورية / محضر الاجتماع بالذكاء الاصطناعي ويجب على المالك الجديد إعادة تفعيلها.
ja: ルームオーナーを譲渡すると一般メンバーになります。リアルタイム字幕 / AI 議事録は停止し、新しいオーナーが再度有効にする必要があります。
zh_hans: 转交房主后，您将成为普通成员。实时字幕 / AI 会议纪要将停止，需由新房主重新开启

# roomkit_transcription_ai_tools
source: AI Tools
ar: أدوات الذكاء الاصطناعي
ja: AIツール
zh_hans: AI 工具

# roomkit_transcription_recording
source: Recording...
ar: جارٍ التسجيل...
ja: 記録中...
zh_hans: 记录中...

# roomkit_transcription_ai_subtitle_placeholder
source: AI Real-time Subtitles
ar: الترجمة الفارية بالذكاء الاصتناعي
ja: AIリアルTIME字幕
zh_hans: AI 实时字幕

# roomkit_transcription_ai_subtitle_settings
source: AI Subtitle Settings
ar: إعدادات الترجمة الفارية بالذكاء الاصتناعي
ja: AI字幕設定
zh_hans: AI 字幕设置

# roomkit_transcription_recognition_and_translation
source: Recognition and Translation Settings
ar: إعدادات الترجمة الفارية بالذكاء الاصتناعي
ja: 識別与翻譯設定
zh_hans: 识别与翻译设置

# roomkit_transcription_identify_language
source: Identify language
ar: الغة التي يتم استخدامها في الترجمة
ja: 識別語言
zh_hans: 识别语言

# roomkit_transcription_owner_only_modify_language
source: Only allow owner to modify identify language
ar: الغة التي يتم استخدامها في الترجمة
ja: 僅房主可以修改識別語言
zh_hans: 仅允许房主修改识别语言

# roomkit_transcription_owner_changed_source_language
source: Owner changed subtitle identify language
ar: الغة التي يتم استخدامها في الترجمة
ja: 房主已更改字幕识别语言类型
zh_hans: 房主已修改字幕识别语言类型

# roomkit_transcription_translate_language
source: Translate language
ar: الغة التي يتم استخدامها في الترجمة
ja: 翻譯語言
zh_hans: 翻译语言

# roomkit_transcription_bilingual_subtitle
source: Show Bilingual Subtitles
ar: عرض الترجمة ثنائية اللغة
ja: 字幕に二言語を表示
zh_hans: 字幕显示双语

# roomkit_transcription_select_recognition_language
source: Please Select Recognition Language
ar: يرجى اختيار لغة التعرف
ja: 認識言語を選択してください
zh_hans: 请选择识别语言

# roomkit_transcription_auto_detect_chinese_english
source: Auto-detect (Chinese/English)
ar: التعرف التلقائي (صينية/إنجليزية)
ja: 自動認識（中国語/英語）
zh_hans: 自动识别 (中英)

# roomkit_transcription_speaking_chinese
source: Speaking Chinese
ar: تتحدث بالصينية
ja: 中国語を話す
zh_hans: 说中文

# roomkit_transcription_speaking_english
source: Speaking English
ar: تتحدث بالإنجليزية
ja: 英語を話す
zh_hans: 说英语

# roomkit_transcription_speaking_cantonese
source: Speaking Cantonese
ar: تتحدث بالكانتونية
ja: 広東語を話す
zh_hans: 说粤语

# roomkit_transcription_speaking_vietnamese
source: Speaking Vietnamese
ar: تتحدث بالفيتنامية
ja: ベトナム語を話す
zh_hans: 说越南语

# roomkit_transcription_speaking_japanese
source: Speaking Japanese
ar: تتحدث باليابانية
ja: 日本語を話す
zh_hans: 说日语

# roomkit_transcription_speaking_korean
source: Speaking Korean
ar: تتحدث بالكورية
ja: 韓国語を話す
zh_hans: 说韩语

# roomkit_transcription_speaking_indonesian
source: Speaking Indonesian
ar: تتحدث بالإندونيسية
ja: インドネシア語を話す
zh_hans: 说印尼语

# roomkit_transcription_speaking_thai
source: Speaking Thai
ar: تتحدث بالتايلاندية
ja: タイ語を話す
zh_hans: 说泰语

# roomkit_transcription_speaking_portuguese
source: Speaking Portuguese
ar: تتحدث بالبرتغالية
ja: ポルトガル語を話す
zh_hans: 说葡萄牙语

# roomkit_transcription_speaking_turkish
source: Speaking Turkish
ar: تتحدث بالتركية
ja: トルコ語を話す
zh_hans: 说土耳其语

# roomkit_transcription_speaking_arabic
source: Speaking Arabic
ar: تتحدث بالعربية
ja: アラビア語を話す
zh_hans: 说阿拉伯语

# roomkit_transcription_speaking_spanish
source: Speaking Spanish
ar: تتحدث بالإسبانية
ja: スペイン語を話す
zh_hans: 说西班牙语

# roomkit_transcription_speaking_hindi
source: Speaking Hindi
ar: تتحدث بالهندية
ja: ヒンディー語を話す
zh_hans: 说印地语

# roomkit_transcription_speaking_french
source: Speaking French
ar: تتحدث بالفرنسية
ja: フランス語を話す
zh_hans: 说法语

# roomkit_transcription_speaking_malay
source: Speaking Malay
ar: تتحدث بالملايو
ja: マレー語を話す
zh_hans: 说马来语

# roomkit_transcription_speaking_filipino
source: Speaking Filipino
ar: تتحدث بالفلبينية
ja: フィリピン語を話す
zh_hans: 说菲律宾语

# roomkit_transcription_speaking_german
source: Speaking German
ar: تتحدث بالألمانية
ja: ドイツ語を話す
zh_hans: 说德语

# roomkit_transcription_speaking_italian
source: Speaking Italian
ar: تتحدث بالإيطالية
ja: イタリア語を話す
zh_hans: 说意大利语

# roomkit_transcription_speaking_russian
source: Speaking Russian
ar: تتحدث بالروسية
ja: ロシア語を話す
zh_hans: 说俄语

# roomkit_transcription_select_translation_language
source: Please Select Translation Language
ar: يرجى اختيار لغة الترجمة
ja: 翻訳言語を選択してください
zh_hans: 请选择翻译语言

# roomkit_transcription_no_translation
source: No Translation
ar: بدون ترجمة
ja: 翻訳なし
zh_hans: 不翻译

# roomkit_transcription_language_chinese
source: 简体中文(Chinese)
ar: 简体中文 (صينية)
ja: 简体中文（中国語）
zh_hans: 简体中文(简体中文)

# roomkit_transcription_language_english
source: English(English)
ar: English (إنجليزية)
ja: English（英語）
zh_hans: English(英语)

# roomkit_transcription_language_vietnamese
source: Tiếng Việt(Vietnamese)
ar: Tiếng Việt (فيتنامية)
ja: Tiếng Việt（ベトナム語）
zh_hans: Tiếng Việt(越南语)

# roomkit_transcription_language_japanese
source: 日本語(Japanese)
ar: 日本語 (يابانية)
ja: 日本語
zh_hans: 日本語(日语)

# roomkit_transcription_language_korean
source: 한국어(Korean)
ar: 한국어 (كورية)
ja: 한국어（韓国語）
zh_hans: 한국어(韩语)

# roomkit_transcription_language_indonesian
source: Bahasa Indonesia(Indonesian)
ar: Bahasa Indonesia (إندونيسية)
ja: Bahasa Indonesia（インドネシア語）
zh_hans: Bahasa Indonesia(印尼语)

# roomkit_transcription_language_thai
source: ภาษาไทย(Thai)
ar: ภาษาไทย (تايلاندية)
ja: ภาษาไทย（タイ語）
zh_hans: ภาษาไทย(泰语)

# roomkit_transcription_language_portuguese
source: Português(Portuguese)
ar: Português (برتغالية)
ja: Português（ポルトガル語）
zh_hans: Português(葡萄牙语)

# roomkit_transcription_language_arabic
source: العربية(Arabic)
ar: العربية
ja: العربية（アラビア語）
zh_hans: العربية(阿拉伯语)

# roomkit_transcription_language_spanish
source: Español(Spanish)
ar: Español (إسبانية)
ja: Español（スペイン語）
zh_hans: Español(西班牙语)

# roomkit_transcription_language_french
source: Français(French)
ar: Français (فرنسية)
ja: Français（フランス語）
zh_hans: Français(法语)

# roomkit_transcription_language_malay
source: Bahasa Melayu(Malay)
ar: Bahasa Melayu (ملايو)
ja: Bahasa Melayu（マレー語）
zh_hans: Bahasa Melayu(马来语)

# roomkit_transcription_language_german
source: Deutsch(German)
ar: Deutsch (ألمانية)
ja: Deutsch（ドイツ語）
zh_hans: Deutsch(德语)

# roomkit_transcription_language_italian
source: Italiano(Italian)
ar: Italiano (إيطالية)
ja: Italiano（イタリア語）
zh_hans: Italiano(意大利语)

# roomkit_transcription_language_russian
source: Русский(Russian)
ar: Русский (روسية)
ja: Русский（ロシア語）
zh_hans: Русский(俄语)

# roomkit_screen_sharing_tip
source: You are sharing your screen...
ar: أنت تشارك شاشتك...
ja: 画面を共有中です...
zh_hans: 您正在共享屏幕...

# roomkit_room_type_meeting
source: Meeting room
ar: غرفة اجتماع
ja: 会議ルーム
zh_hans: 会议房间

# roomkit_room_type_webinar
source: Webinar room
ar: غرفة ندوة
ja: ウェビナールーム
zh_hans: 研讨会房间

# roomkit_start_screen_share
source: Screen share
ar: مشاركة الشاشة
ja: 画面共有
zh_hans: 屏幕分享

# roomkit_stop_screen_share
source: End sharing
ar: إنهاء المشاركة
ja: 共有を終了
zh_hans: 结束共享

# roomkit_stop_screen_share_confirm
source: After ending sharing, others will no longer be able to view your screen. Are you sure you want to end sharing?
ar: بعد إنهاء المشاركة، لن يتمكن الآخرون من الاستمرار في مشاهدة شاشتك. هل أنت متأكد أنك تريد إنهاء المشاركة؟
ja: 共有を終了すると、他のユーザーはあなたの画面を視聴できなくなります。共有を終了してもよろしいですか？
zh_hans: 结束共享后，其他人将无法继续观看你的屏幕内容，确定要结束共享吗？

# roomkit_another_is_sharing_the_screen
source: Another user is sharing the screen.
ar: مستخدم آخر يشارك الشاشة.
ja: 他のユーザーが画面を共有しています。
zh_hans: 其他用户正在共享屏幕。

# roomkit_btn_stop
source: Stop
ar: إيقاف
ja: 停止
zh_hans: 停止

# roomkit_video_share_occupied
source: The speaker seat is already occupied. Unable to enable the camera.
ar: مقعد المتحدث الرئيسي مشغول بالفعل. لا يمكن تشغيل الكاميرا.
ja: メインスピーカー席は既に占有されています。カメラを有効にできません。
zh_hans: 主讲嘉宾席位已被占用，无法开启摄像头。

# roomkit_screen_share_occupied
source: The speaker seat is already occupied. Unable to start screen sharing.
ar: مقعد المتحدث الرئيسي مشغول بالفعل. لا يمكن بدء مشاركة الشاشة.
ja: メインスピーカー席は既に占有されています。画面共有を開始できません。
zh_hans: 主讲嘉宾席位已被占用，无法开启屏幕分享。

# roomkit_camera_blocked_by_screen_share
source: Currently screen sharing. Unable to turn on video. Please stop screen sharing first
ar: مشاركة الشاشة جارية حالياً. لا يمكن تشغيل الفيديو. يرجى إيقاف مشاركة الشاشة أولاً
ja: 現在画面共有中のため、ビデオをオンにできません。先に画面共有を停止してください
zh_hans: 当前正在屏幕分享中，无法打开视频，请先关闭屏幕分享

# roomkit_screen_share_blocked_by_camera
source: Currently streaming video. Unable to start screen sharing. Please turn off video first
ar: البث المباشر للفيديو جارٍ حالياً. لا يمكن بدء مشاركة الشاشة. يرجى إيقاف الفيديو أولاً
ja: 現在ビデオ配信中のため、画面共有を開始できません。先にビデオをオフにしてください
zh_hans: 当前正在视频推流，无法开启屏幕分享，请先关闭视频

# roomkit_screen_share_start_message
source: Someone is currently presenting. Starting screen sharing will interrupt their presentation. Continue?
ar: شخص ما يقدم حاليًا. ستؤدي مشاركة الشاشة إلى مقاطعة عرضه التقديمي. هل تريد المتابعة؟
ja: 現在誰かがプレゼンテーションを行っています。画面共有を開始するとプレゼンテーションが中断されます。続行しますか？
zh_hans: 当前有人正在主讲，开始屏幕分享后将中断其主讲，是否继续？

# roomkit_all_screen_share_disabled
source: Screen sharing disabled for participants.
ar: تم تعطيل مشاركة الشاشة للمشاركين.
ja: 参加者の画面共有が無効になりました。
zh_hans: 已禁止成员屏幕共享

# roomkit_all_screen_share_enabled
source: Screen sharing enabled for participants.
ar: تم تفعيل مشاركة الشاشة للمشاركين.
ja: 参加者の画面共有が有効になりました。
zh_hans: 已允许成员开启屏幕共享

# roomkit_not_allowed_to_screen_share
source: Currently only host/admins can share screen.
ar: حالياً يمكن للمضيف/المسؤولين فقط مشاركة الشاشة.
ja: 現在はホスト/管理者のみ画面共有が可能です。
zh_hans: 当前仅主持人/管理员可以共享屏幕。

# roomkit_video_start_message
source: Someone is currently presenting. Turning on your video will interrupt their presentation. Continue?
ar: شخص ما يقدم حاليًا. سيؤدي تشغيل الفيديو الخاص بك إلى مقاطعة عرضه التقديمي. هل تريد المتابعة؟
ja: 現在誰かがプレゼンテーションを行っています。ビデオをオンにするとプレゼンテーションが中断されます。続行しますか？
zh_hans: 当前有人正在主讲，打开视频后将中断其主讲，是否继续？

# roomkit_toast_screen_share_closed_by_host
source: Your screen sharing has been stopped by xxx
ar: xxx قام بإيقاف مشاركة الشاشة الخاصة بك
ja: xxxによって画面共有が停止されました
zh_hans: xxx已停止您的屏幕共享

# roomkit_screen_sharing_status
source: Screen sharing
ar: مشاركة الشاشة
ja: 画面共有中
zh_hans: 屏幕分享中

# roomkit_hands_up
source: Raise hand
ar: رفع اليد
ja: 挙手
zh_hans: 举手

# roomkit_hands_down
source: Lower hand
ar: خفض اليد
ja: 手を下ろす
zh_hans: 手放下

# roomkit_hands_up_list
source: Raised hands list
ar: قائمة الأيدي المرفوعة
ja: 挙手リスト
zh_hans: 举手列表

# roomkit_hands_up_empty
source: No raised hands
ar: لا توجد أيدي مرفوعة
ja: 挙手リクエストはありません
zh_hans: 暂无举手请求
